{"pageProps":{"post":{"title":"Text RPG Engine","date":"2019","createdDate":"2019","slug":"text-rpg-engine","tags":"javascript,es6,interactive fiction,nlp","content":"<a href=\"https://github.com/jddunn/text-rpg-engine\" style=\"text-align: center\" target=\"_blank\" class=\"md-link\">GitHub link</a>\n\n<a href=\"https://jddunn.github.io/text-rpg-engine\" style=\"text-align: center\" target=\"_blank\" class=\"md-link\">Library Website / Docs</a>\n\n<a href=\"https://web.archive.org/web/20201107233844/https://clubhouse.io/developer-how-to/writing-object-oriented-javascript-es6-modules-with-text-rpgs/\" style=\"text-align: center\" target=\"_blank\" class=\"md-link\">Tutorial article written for Clubhouse (Archival link)</a>\n\n<a href=\"https://www.npmjs.com/package/text-rpg-engine\" style=\"text-align: center\" target=\"_blank\" class=\"md-link\">NPM package link</a>\n\ntext-rpg-engine is a JavaScript ES6 library that can be compiled and run without a server to create works of interactive fiction, or text adventures, with completely arbitrary player interactions. As in, experiences built with text-rpg-engine can contain player interactions of any kind, which allows for endless possibilities in terms of puzzles and crafting unique gameplay mechanics.\n\nIn this example shown in the photo, a unique puzzle in the room is having to turn over the statue to find the note on the bottom.\n\nThis engine was also used to create the game featured on the homepage of this site.\n\nYou can create games programmatically via the library's API, or you can define the data in a JSON file and have it be dynamically loaded by the library. A future feature would be to have a GUI editor that can easily create and add onto existing games.\n\n## Features\n\n- Games can be programmatically built with API or populated with data from a static JSON file\n- No server required to play games (JS files are bundled and transpiled with Browserify)\n- Player can move through rooms (rooms can have item requirements)\n- Inventory system\n- Environment and item interactions through prompts\n- Extreme flexibility; prompts can be anything and are stored in rooms, so prompts can have the same keyword triggers as long as they belong to different rooms\n\nI am planning on creating an interactive fiction game with horror themes using this engine, to be submitted to IFComp in the next year.\n","ogImage":{"url":"/assets/projects/text-rpg-demo-full.gif"},"coverImage":"/assets/projects/text-rpg-demo-full.gif"}},"__N_SSG":true}